podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/OSC32_MKE16F16.svd.xml
<!--
Devices using this peripheral: 
      MKE14F16
      MKE14Z7
      MKE15Z7
      MKE16F16
      MKE18F16
-->
      <peripheral>
         <?sourceFile "OSC32_MKE16F16" ?>
         <name>OSC32</name>
         <description>RTC Oscillator</description>
         <groupName>OSC</groupName>
         <headerStructName>OSC32</headerStructName>
         <baseAddress>0x40060000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x1</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR</name>
               <description>RTC Oscillator Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ROSCEREFS</name>
                     <description>RTC 32k Oscillator external reference clcok selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Bypass mode. RTC oscillator selects the external 32k clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Crystal mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROSCSTB</name>
                     <description>RTC 32k Oscillator stable flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>RTC 32k oscillator is unstable now and no clock will go out of the block</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>RTC 32k oscillator is stable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROSCSTPEN</name>
                     <description>RTC 32k Oscillator stop mode enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Oscillator is disabled regardless the state of ROSCEN</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Oscillator is enabled in Stop mode when ROSCEN is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROSCEN</name>
                     <description>RTC 32k Oscillator enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Oscillator is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Oscillator is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
